app/controllers/todolists_controller.rb

  def create
    # １. データを新規登録するためのインスタンス作成
    list = List.new(list_params)
    # ２. データをデータベースに保存するためのsaveメソッド実行
    list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "rails 勉強"], ["body", "abc"], ["created_at", "2021-03-09 07:02:24.771530"], ["updated_at", "2021-03-09 07:02:24.771530"]]

  def index
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
   list = List.find(params[:id])
   list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "abc\r\nabc"], ["updated_at", "2021-03-09 08:05:11.212977"], ["id", 1]]

  def destroy
  list = List.find(params[:id])
  list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 3]]